amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/deleteBucket.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.deletebucket">
	<soapenv:Header/>
	<soapenv:Body>
		<urn:accessKeyId>AKIAJ5H4DUFA3O2VJMLA</urn:accessKeyId>
		<urn:secretAccessKey>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</urn:secretAccessKey>
		<urn:methodType>DELETE</urn:methodType>
		<urn:contentType>application/xml</urn:contentType>
		<urn:bucketName>deun12ajkewq</urn:bucketName>
		<urn:xAmzDate>true</urn:xAmzDate>
		<urn:xAmzSecurityToken></urn:xAmzSecurityToken>
		<urn:contentMD5></urn:contentMD5>
		<urn:bucketUrl>http://deun12ajkewq.s3.amazonaws.com</urn:bucketUrl>
		<urn:uriRemainder>/</urn:uriRemainder>
		<urn:expect></urn:expect>
		<urn:contentLength></urn:contentLength>
   </soapenv:Body>
</soapenv:Envelope>